# # Задача 1
# #  Напишите программу Резюме. На вход подается Имя, Фамилия, Отчество, Возраст
# # и на выходы в консоль выдаем следующий текст: Здравствуйте! Меня зовут Имя
# # Фамилия Отчество. Мне Возраст и я хочу у Вас работать.
# name = input("Введите свое имя: ")
# surname = input("Введите свою фамилию: ")
# patronymic = input("Введите свое отчество: ")
# age = input("Введите свой возраст:")
# print("Здравствуйте!"+" "+"Меня зовут"+" "+name+" "+surname+" "+patronymic+"."+" "+"Мне"+" "+age+" "+"и я хочу у Вас работать.")


# # Задача №2
# # Напишите программу, в которую на вход подается два числа a и b. На выходе получаем
# # строку: Целая часть от деления N и остаток M
# a = int(input("Введите число: "))
# b = int(input("Введите число: "))
# n = a // b
# m = a % b
# print(n,m)

# Задача №3
# Напишите программу, которая сравнивает две строки. На вход подается str1 и str2. И
# на выходе мы получаем True или False.
# str1 = input("Введите 1 слово: ")
# str2 = input("Введите 2 слово: ")
# print(str1 == str2)

# # Задача №4
# # Напишите программу, в которой есть константа MULTIPLE_VAL=6.4 и на вход
# # подается число M. На выходе получаем число M*MULTIPLE_VAL и все значения
# # сконвертированные в integer, string.
# MULTIPLE_VAL = 6.4
# M = float(input("Введите число M: "))
# result_float = M * MULTIPLE_VAL
# result_int = int(result_float)
# result_str = str(result_float)
# print(f"Результат (вещественное число): {result_float}")
# print(f"Результат (целое число): {result_int}")
# print(f"Результат (строка): {result_str}")



