# #Задача №1
# # Напишите программу, в которой я ввожу целые числа a, b, c.
# # Если существует треугольник
# # со сторонами a, b, c, то программа
# # выведет true, иначе false
# a = int(input("Введите длину стороны a: "))
# b = int(input("Введите длину стороны b: "))
# c = int(input("Введите длину тороны c: "))
# if a + b > c and a + c > b and b + c > a:
#     print("True")
# else:
#     print("False")


# # Задача №2
# # Напишите программу, в которой я ввожу число a. Если число, а является четным, то
# # программа выведет true, иначе false.
# a = int(input("Введите число: "))
# if a%2==0:
#     print("True")
# else:
#     print("False")

# # Задача №3
# # Напишите программу, в которой я ввожу три целостных чисел a, b и c,
# # и если сумма a и b больше c,
# # то программа выведет true, иначе false.
#
# a = int(input("Введите первое число: "))
# b = int(input("Введите второе число: "))
# c = int(input("Введите третье число: "))
# if a + b > c:
#     print("True")
# else:
#     print("False")


# # Задание №4
# # Напишите программу, в которой я ввожу два целостных числа,
# # и если первое число больше второго, то программа выведет true, иначе false.
#
# a = int(input("Введите первое число: "))
# b = int(input("Введите второе число: "))
# if a > b:
#     print("True")
# else:
#     print("False")